app/controllers/chatrooms_controller.rb

    def create
        @room = Chatroom.new(room_params)

        respond_to do |f|
            if (@room.save)
---
INSERT INTO "chatrooms" ("title", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Collin"], ["password", "r3d!r3ct"], ["created_at", "2017-08-22 16:06:19.004631"], ["updated_at", "2017-08-22 16:06:19.004631"]]