app/controllers/messages_controller.rb

INSERT INTO "messages" ("content", "user_id", "chatroom", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "rewwre"], ["user_id", 1], ["chatroom", 2], ["created_at", "2017-08-22 16:57:46.889941"], ["updated_at", "2017-08-22 16:57:46.889941"]]
---
    def create
        url = "https://parakeet-corear.c9users.io/room/2"
        uri = URI::parse(url)
        id = uri.path.split('/')[2]
        @message = Message.new(room_params)
        @message.user_id = current_user.id
        @message.chatroom = id
        respond_to do |f|
            if (@message.save)