app/controllers/pages_controller.rb

SELECT "chatrooms".* FROM "chatrooms"
---
  def home
    @newRoom = Chatroom.new
    @rooms = Chatroom.all

SELECT  "chatrooms".* FROM "chatrooms" WHERE "chatrooms"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "messages".* FROM "messages" WHERE (chatroom = '2')  ORDER BY "messages"."created_at" DESC LIMIT 50
---
  def room
    @room = Chatroom.find(params[:id])
    @access = params[:id]
    @newMessage = Message.new
    @messages = Message.all.where('chatroom = ?', params[:id]).take(50)